Revit 2024 API
UnitUtils.GetAllUnits Method
 Gets the identifiers of all available units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static IList<ForgeTypeId> GetAllUnits()
Visual Basic
Public Shared Function GetAllUnits As IList(Of ForgeTypeId)
Visual C++
public:
static IList<ForgeTypeId^>^ GetAllUnits()
Return Value
 The unit identifiers.
See Also
UnitUtils Class
Autodesk.Revit.DB Namespace